
{"_id":{"$oid":"6547c5569a2d8019f7c162e5"},"type":"Free","title":"Geometry: Introduction to Shapes","desc":"Explore the world of shapes, angles, and geometric principles with a focus on polygons, circles, and their properties.","content":"<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Point:</strong> A point is a location in space and has no size or dimension. It is typically represented by a dot.</p>\n</li>\n<li>\n<p><strong>Line:</strong> A line is a straight path that extends infinitely in both directions. It is represented by a straight line with arrows on both ends.</p>\n</li>\n<li>\n<p><strong>Line Segment:</strong> A line segment is a part of a line with two endpoints. It has a definite length.</p>\n</li>\n<li>\n<p><strong>Ray:</strong> A ray is a part of a line that starts at one endpoint and extends infinitely in one direction.</p>\n</li>\n<li>\n<p><strong>Angle:</strong> An angle is formed by two rays that share a common endpoint called the vertex. Angles are typically measured in degrees.</p>\n</li>\n<li>\n<p><strong>Polygon:</strong> A polygon is a closed shape with straight sides. Common polygons include triangles, quadrilaterals (like squares and rectangles), pentagons, and so on.</p>\n</li>\n<li>\n<p><strong>Circle:</strong> A circle is a set of points in a plane that are equidistant from a central point called the center. It is defined by its radius and diameter.</p>\n</li>\n<li>\n<p><strong>Area:</strong> The area of a shape is the measure of the region enclosed by its boundary. Different shapes have different formulas for calculating their area.</p>\n</li>\n<li>\n<p><strong>Perimeter:</strong> The perimeter of a shape is the sum of the lengths of its sides.</p>\n</li>\n<li>\n<p><strong>Congruence:</strong> Two shapes are congruent if they have the same shape and size.</p>\n</li>\n<li>\n<p><strong>Similarity:</strong> Two shapes are similar if they have the same shape but can be of different sizes.</p>\n</li>\n</ol>\n<p>&nbsp;</p>","images":[],"files":[],"tags":["Math","Combined Math"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699202390246"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}
{"_id":{"$oid":"6547c59a9a2d8019f7c162e7"},"type":"Free","title":"Calculus Fundamentals","desc":"Dive into the fundamentals of calculus, including limits, derivatives, and integrals, which are essential for advanced mathematical concepts.","content":"<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Differentiation</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Derivative:</strong> The derivative of a function represents its rate of change at a specific point. It measures how the function's output (y) changes as the input (x) changes.</li>\n<li><strong>Notation:</strong> The derivative of a function f(x) is often denoted as f'(x) or dy/dx.</li>\n<li><strong>Rules:</strong> Calculus includes rules for finding derivatives, such as the power rule, product rule, and chain rule.</li>\n</ul>\n</li>\n<li>\n<p><strong>Integration</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Integral:</strong> Integration is the process of finding the accumulated change, or the area under a curve. The integral of a function is represented by &int; (the elongated \"S\" symbol).</li>\n<li><strong>Definite and Indefinite Integrals:</strong> You have definite integrals, which find the accumulated change between two specific points, and indefinite integrals, which find a general antiderivative.</li>\n<li><strong>Fundamental Theorem of Calculus:</strong> This theorem connects differentiation and integration, stating that integration undoes differentiation, and vice versa.</li>\n</ul>\n</li>\n<li>\n<p><strong>Applications</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Calculus is used in various fields, including physics, engineering, economics, and more, to model and analyze change and motion.</li>\n<li>Applications include finding the velocity of an object, determining areas under curves, optimizing functions, and solving differential equations.</li>\n</ul>\n</li>\n<li>\n<p><strong>Limits</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Calculus involves the concept of limits, which is fundamental to understanding derivatives and integrals. A limit describes the behavior of a function as it approaches a certain value.</li>\n</ul>\n</li>\n<li>\n<p><strong>Continuous and Differentiable Functions</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Functions are often classified as continuous if there are no breaks in their graphs and differentiable if they have well-defined derivatives.</li>\n</ul>\n</li>\n</ol>","images":[],"files":[],"tags":["Math","Combined Math"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699202458061"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547c5db9a2d8019f7c162e9"},"type":"Free","title":"Statistics: Data Analysis","desc":"Learn how to collect, organize, and analyze data, including topics like mean, median, and standard deviation.","content":"<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Data Types</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Categorical Data:</strong> This type of data represents categories or labels, such as colors or types of cars.</li>\n<li><strong>Numerical Data:</strong> Numerical data includes measurements or counts and can be further categorized into discrete (whole numbers) and continuous (infinite number of values) data.</li>\n</ul>\n</li>\n<li>\n<p><strong>Data Collection</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Data can be collected through surveys, experiments, observations, or from existing sources. It's essential to ensure that data collection is unbiased and representative.</li>\n</ul>\n</li>\n<li>\n<p><strong>Descriptive Statistics</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Descriptive statistics help in summarizing and describing data. This includes measures like mean (average), median (middle value), and mode (most frequent value).</li>\n</ul>\n</li>\n<li>\n<p><strong>Inferential Statistics</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Inferential statistics involve making inferences or predictions about a population based on a sample of data. This includes hypothesis testing and confidence intervals.</li>\n</ul>\n</li>\n<li>\n<p><strong>Data Visualization</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Data can be represented graphically using various charts and plots, such as histograms, bar charts, scatterplots, and box plots, to help understand and communicate patterns in the data.</li>\n</ul>\n</li>\n<li>\n<p><strong>Measures of Dispersion</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Measures like the range, variance, and standard deviation provide insights into how spread out the data is.</li>\n</ul>\n</li>\n<li>\n<p><strong>Probability</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Probability theory is used to quantify uncertainty and randomness in data. It's crucial for making predictions and drawing conclusions.</li>\n</ul>\n</li>\n<li>\n<p><strong>Statistical Software</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Many statistical analyses are performed using software like R, Python, or specialized statistical packages such as SPSS and SAS.</li>\n</ul>\n</li>\n<li>\n<p><strong>Statistical Tests</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Various statistical tests are used to determine relationships or differences between variables. Examples include t-tests, chi-squared tests, and ANOVA (Analysis of Variance).</li>\n</ul>\n</li>\n<li>\n<p><strong>Regression Analysis</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Regression models are used to understand the relationship between one or more independent variables and a dependent variable. Simple linear regression and multiple regression are common types.</li>\n</ul>\n</li>\n<li>\n<p><strong>Data Ethics</strong>:</p>\n<ul style=\"list-style-type: disc;\">\n<li>Ethical considerations are crucial in data analysis, including ensuring data privacy, avoiding bias, and providing accurate and transparent results.</li>\n</ul>\n</li>\n</ol>\n<p>Data analysis is a vast and essential field, and it plays a significant role in various industries, including science, business, and social sciences.</p>","images":[],"files":[],"tags":["Math","Combined Math"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699202523275"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547c6429a2d8019f7c162eb"},"type":"Pro","title":"Probability Theory","desc":"Understand the basics of probability theory, including concepts of probability, random variables, and probability distributions.","content":"<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Probability:</strong> Probability is a measure of the likelihood that an event will occur. It is usually expressed as a number between 0 (impossible) and 1 (certain).</p>\n</li>\n<li>\n<p><strong>Sample Space:</strong> The sample space is the set of all possible outcomes of a random experiment. For example, when rolling a six-sided die, the sample space consists of the numbers 1 through 6.</p>\n</li>\n<li>\n<p><strong>Event:</strong> An event is a subset of the sample space. It represents a specific outcome or a combination of outcomes. Events can be simple (e.g., rolling a 3) or compound (e.g., rolling an even number).</p>\n</li>\n<li>\n<p><strong>Probability Distribution:</strong> A probability distribution assigns probabilities to each possible outcome in the sample space. Common probability distributions include the uniform distribution, normal distribution, and binomial distribution.</p>\n</li>\n<li>\n<p><strong>Conditional Probability:</strong> Conditional probability is the probability of an event occurring given that another event has already occurred. It's denoted as P(A | B), where A is the event of interest, and B is the condition.</p>\n</li>\n<li>\n<p><strong>Independence:</strong> Two events are independent if the occurrence of one does not affect the probability of the other. Independence is a fundamental concept in probability.</p>\n</li>\n<li>\n<p><strong>Random Variables:</strong> A random variable is a variable that can take on different values with associated probabilities. It can be discrete (e.g., the number of heads in a coin toss) or continuous (e.g., the height of individuals in a population).</p>\n</li>\n<li>\n<p><strong>Expected Value (Mean):</strong> The expected value of a random variable is the long-term average or mean value it would take on in many repetitions of the random experiment.</p>\n</li>\n<li>\n<p><strong>Variance and Standard Deviation:</strong> Variance measures the spread of a probability distribution, while the standard deviation is the square root of the variance.</p>\n</li>\n<li>\n<p><strong>Probability Mass Function (PMF) and Probability Density Function (PDF):</strong> PMF is used for discrete random variables, while PDF is used for continuous random variables. They describe the probabilities associated with specific values or intervals.</p>\n</li>\n<li>\n<p><strong>Law of Large Numbers:</strong> This law states that as the number of trials or experiments increases, the observed relative frequency of an event will converge to its theoretical probability.</p>\n</li>\n<li>\n<p><strong>Central Limit Theorem:</strong> This theorem states that the sum or average of a large number of independent and identically distributed random variables approaches a normal distribution, regardless of the original distribution.</p>\n</li>\n</ol>","images":[],"files":[],"tags":["Math","Combined Math","Mathematics"],"price":{"$numberLong":"20"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699202626145"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547c6d19a2d8019f7c162ee"},"type":"Pro","title":"Biology: Cell Structure and Function","desc":"Explore the intricate world of cell biology, covering cell types, organelles, their functions, and cellular processes.","content":"<p><strong>Cell Types:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Prokaryotic Cells:</strong> These are simple, single-celled organisms without a true nucleus. Bacteria are examples of prokaryotes.</p>\n</li>\n<li>\n<p><strong>Eukaryotic Cells:</strong> Eukaryotic cells are more complex and have a true nucleus containing genetic material. All plants, animals, fungi, and many microorganisms consist of eukaryotic cells.</p>\n</li>\n</ol>\n<p><strong>Common Cell Structures:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Plasma Membrane:</strong> The cell's outer boundary that separates it from the external environment. It regulates the passage of substances in and out of the cell.</p>\n</li>\n<li>\n<p><strong>Cytoplasm:</strong> The semi-fluid substance within the cell where various organelles are located.</p>\n</li>\n<li>\n<p><strong>Nucleus:</strong> In eukaryotic cells, the nucleus contains genetic material (DNA) and controls cell activities.</p>\n</li>\n</ol>\n<p><strong>Organelles within Eukaryotic Cells:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Mitochondria:</strong> The \"powerhouses\" of the cell, where energy (ATP) is produced through cellular respiration.</p>\n</li>\n<li>\n<p><strong>Endoplasmic Reticulum (ER):</strong> Involved in protein and lipid synthesis. Rough ER has ribosomes on its surface, while smooth ER lacks ribosomes.</p>\n</li>\n<li>\n<p><strong>Golgi Apparatus:</strong> Packages and modifies proteins for transport within or outside the cell.</p>\n</li>\n<li>\n<p><strong>Lysosomes:</strong> Contain enzymes for breaking down waste materials and cellular debris.</p>\n</li>\n<li>\n<p><strong>Vacuoles:</strong> Storage organelles that store water, nutrients, and waste products.</p>\n</li>\n<li>\n<p><strong>Chloroplasts (in plant cells):</strong> Contain chlorophyll and are responsible for photosynthesis.</p>\n</li>\n<li>\n<p><strong>Cytoskeleton:</strong> A network of protein filaments that provides structural support and is involved in cell movement.</p>\n</li>\n</ol>\n<p><strong>Cell Functions:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Energy Production:</strong> Cells produce energy through processes like cellular respiration (in mitochondria) and photosynthesis (in chloroplasts).</p>\n</li>\n<li>\n<p><strong>Replication:</strong> Cells can reproduce through processes like mitosis (cell division) and meiosis (reproductive cell division).</p>\n</li>\n<li>\n<p><strong>Transport:</strong> Cells can move materials in and out through active and passive transport mechanisms.</p>\n</li>\n<li>\n<p><strong>Protein Synthesis:</strong> Cells produce proteins, which are essential for various cellular functions.</p>\n</li>\n<li>\n<p><strong>Cell Communication:</strong> Cells can communicate with each other through signaling pathways.</p>\n</li>\n<li>\n<p><strong>Waste Elimination:</strong> Cells have mechanisms to eliminate waste and maintain internal conditions.</p>\n</li>\n</ol>","images":[],"files":[],"tags":["Science","Bio","biology"],"price":{"$numberLong":"10"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699202765946"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547c74a9a2d8019f7c162f0"},"type":"Free","title":"Chemistry: The Periodic Table","desc":"Discover the periodic table of elements, element properties, and how it's organized to understand chemical behavior.","content":"<p><strong>Key Elements:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Atomic Number:</strong> The atomic number is the number of protons in the nucleus of an atom. It uniquely identifies each element on the periodic table.</p>\n</li>\n<li>\n<p><strong>Atomic Symbol:</strong> Each element is represented by a one- or two-letter symbol, such as H for hydrogen, O for oxygen, and Fe for iron.</p>\n</li>\n</ol>\n<p><strong>Periods and Groups:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Periods:</strong> Rows in the periodic table are called periods. There are seven periods in total, and they represent the number of energy levels or electron shells an element's atoms have.</p>\n</li>\n<li>\n<p><strong>Groups:</strong> Columns in the periodic table are called groups. There are 18 groups, each with similar chemical properties. Elements in the same group have the same number of valence electrons.</p>\n</li>\n</ol>\n<p><strong>Key Concepts:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Valence Electrons:</strong> Valence electrons are the electrons in the outermost energy level of an atom. They determine the chemical properties of an element.</p>\n</li>\n<li>\n<p><strong>Noble Gases:</strong> Group 18 elements are known as noble gases and are chemically inert because they have full electron shells.</p>\n</li>\n<li>\n<p><strong>Transition Metals:</strong> Groups 3-12 are the transition metals, known for their varied oxidation states and colorful compounds.</p>\n</li>\n<li>\n<p><strong>Alkali Metals:</strong> Group 1 elements are highly reactive and include lithium, sodium, and potassium.</p>\n</li>\n<li>\n<p><strong>Alkaline Earth Metals:</strong> Group 2 elements are also reactive but less so than the alkali metals. Examples include calcium and magnesium.</p>\n</li>\n<li>\n<p><strong>Halogens:</strong> Group 17 elements are highly reactive nonmetals, including fluorine, chlorine, and iodine.</p>\n</li>\n<li>\n<p><strong>Metalloids:</strong> Elements with properties intermediate between metals and nonmetals are known as metalloids. They are found along the \"staircase\" on the periodic table.</p>\n</li>\n</ol>\n<p><strong>Periodic Trends:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Atomic Radius:</strong> Increases down a group and decreases across a period.</p>\n</li>\n<li>\n<p><strong>Ionization Energy:</strong> Decreases down a group and increases across a period.</p>\n</li>\n<li>\n<p><strong>Electronegativity:</strong> Decreases down a group and increases across a period.</p>\n</li>\n<li>\n<p><strong>Metallic Character:</strong> Increases down a group and decreases across a period.</p>\n</li>\n</ol>\n<p><strong>Applications:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>The periodic table is essential for understanding chemical reactions, predicting the behavior of elements, and organizing the study of chemistry.</p>\n</li>\n<li>\n<p>It's a tool for identifying the properties and behavior of elements, as well as for balancing chemical equations.</p>\n</li>\n<li>\n<p>The periodic table helps chemists categorize elements into groups with similar properties, aiding in the development of new materials and compounds.</p>\n</li>\n</ul>","images":[],"files":[],"tags":["Science","Chemistry"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699202890041"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547c7b49a2d8019f7c162f2"},"type":"Free","title":"Physics: Newton's Laws of Motion","desc":"Delve into Newton's three laws of motion, the foundation of classical mechanics, and their real-world applications.","content":"<p><strong>1. Newton's First Law (Law of Inertia):</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Statement:</strong> An object at rest tends to stay at rest, and an object in motion tends to stay in motion with the same speed and in the same direction unless acted upon by an external force.</li>\n<li><strong>Explanation:</strong> This law describes the concept of inertia, which is the tendency of an object to resist changes in its state of motion. In the absence of external forces, an object will maintain its velocity or remain at rest.</li>\n</ul>\n<p><strong>2. Newton's Second Law (Law of Acceleration):</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Statement:</strong> The acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass. It is described by the equation F = ma, where F is the net force, m is the mass of the object, and a is its acceleration.</li>\n<li><strong>Explanation:</strong> This law quantitatively relates force, mass, and acceleration. It states that the greater the force applied to an object, the greater its acceleration will be. Conversely, a larger mass will result in a smaller acceleration for the same force.</li>\n</ul>\n<p><strong>3. Newton's Third Law (Action-Reaction Law):</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Statement:</strong> For every action, there is an equal and opposite reaction. When one object exerts a force on another object, the second object exerts an equal force in the opposite direction.</li>\n<li><strong>Explanation:</strong> This law highlights the principle of action and reaction. It means that any force applied by one object to another is met with an equal and opposite force. This law is responsible for the motion of objects and the interactions between them.</li>\n</ul>","images":["https://firebasestorage.googleapis.com/v0/b/notemex-76c0b.appspot.com/o/images%2Fphysics-fibonacci-sequence-u0qvrs3i3c1ms6fd.jpg?alt=media&token=cf36cdee-550c-4bfa-b651-c6baceeb22df","https://firebasestorage.googleapis.com/v0/b/notemex-76c0b.appspot.com/o/images%2Fphysics-w4ac9eqvnunc0ocp.jpg?alt=media&token=b3d33f14-e103-4381-9fb6-2cf3a137a60f"],"files":["https://firebasestorage.googleapis.com/v0/b/notemex-76c0b.appspot.com/o/images%2Fphysics-fibonacci-sequence-u0qvrs3i3c1ms6fd.jpg?alt=media&token=cf36cdee-550c-4bfa-b651-c6baceeb22df","https://firebasestorage.googleapis.com/v0/b/notemex-76c0b.appspot.com/o/images%2Fphysics-fibonacci-sequence-u0qvrs3i3c1ms6fd.jpg?alt=media&token=cf36cdee-550c-4bfa-b651-c6baceeb22df"],"tags":["Science","Physics","O/L"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699202996222"}},"updatedAt":{"$date":{"$numberLong":"1699284118691"}}}

{"_id":{"$oid":"6547c8289a2d8019f7c162f4"},"type":"Free","title":"Earth Science: Plate Tectonics","desc":" Learn about the movement of Earth's lithospheric plates, and how it leads to geological features like earthquakes and volcanoes.","content":"<p><strong>Key Concepts:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Lithosphere:</strong> The Earth's outer shell is divided into several rigid, tectonic plates. These plates are made up of both the Earth's crust and the upper part of the mantle. They \"float\" on the semi-fluid asthenosphere beneath them.</p>\n</li>\n<li>\n<p><strong>Plate Boundaries:</strong> There are three main types of plate boundaries where tectonic plates interact:</p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Divergent Boundaries:</strong> Plates move away from each other, leading to the formation of new crust. This occurs at mid-ocean ridges.</li>\n<li><strong>Convergent Boundaries:</strong> Plates move toward each other, resulting in the subduction of one plate beneath another. This can lead to mountain formation, earthquakes, and volcanic activity.</li>\n<li><strong>Transform Boundaries:</strong> Plates slide past each other horizontally, causing lateral motion along fault lines. This results in earthquakes.</li>\n</ul>\n</li>\n<li>\n<p><strong>Continental Drift:</strong> The theory of plate tectonics explains the movement of continents over time. Alfred Wegener's theory of continental drift suggested that the continents were once part of a supercontinent called Pangaea and have since drifted apart.</p>\n</li>\n<li>\n<p><strong>Seafloor Spreading:</strong> At mid-ocean ridges (divergent boundaries), new oceanic crust is created as molten material rises from the mantle and solidifies. This process pushes the existing seafloor away from the ridge.</p>\n</li>\n<li>\n<p><strong>Subduction Zones:</strong> In convergent boundaries, when an oceanic plate collides with a continental plate, the denser oceanic plate sinks beneath the less dense continental plate. This process can lead to the formation of deep ocean trenches and volcanic arcs.</p>\n</li>\n</ol>\n<p><strong>Geological Features and Phenomena:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Mountain Ranges:</strong> The collision of tectonic plates at convergent boundaries can result in the formation of mountain ranges. For example, the Himalayas were formed by the collision of the Indian Plate with the Eurasian Plate.</p>\n</li>\n<li>\n<p><strong>Volcanoes:</strong> Volcanic activity often occurs at convergent boundaries (e.g., the Pacific Ring of Fire) and divergent boundaries (mid-ocean ridges).</p>\n</li>\n<li>\n<p><strong>Earthquakes:</strong> The movement of tectonic plates, particularly at transform boundaries, can lead to the release of energy in the form of earthquakes.</p>\n</li>\n<li>\n<p><strong>Mid-Ocean Ridges:</strong> These underwater mountain ranges are formed at divergent boundaries, where new oceanic crust is created.</p>\n</li>\n</ol>\n<p><strong>Plate Tectonics' Significance:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>Plate tectonics is crucial for understanding geological processes, including the formation of mountain ranges, ocean basins, and volcanic islands.</p>\n</li>\n<li>\n<p>It explains the distribution of earthquakes and volcanic activity around the world.</p>\n</li>\n<li>\n<p>It plays a key role in the study of Earth's history, including the movement of continents over millions of years.</p>\n</li>\n</ul>","images":[],"files":[],"tags":["Earth Science","Science"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699203112416"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547c94b9a2d8019f7c162f6"},"type":"Free","title":"Astronomy","desc":"Explore our solar system, its celestial objects, and their unique characteristics, from the sun to distant planets.","content":"<p><strong><img src=\"https://www.eurokidsindia.com/blog/wp-content/uploads/2023/08/exploring-astronomy.jpg\" alt=\"\" width=\"485\" height=\"277\"></strong></p>\n<ol>\n<li><strong> Celestial Objects:</strong></li>\n</ol>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Stars:</strong> Luminous celestial objects primarily composed of hydrogen and helium that produce light and energy through nuclear fusion.</li>\n<li><strong>Planets:</strong> Objects that orbit stars, including the eight planets in our solar system.</li>\n<li><strong>Moons (Natural Satellites):</strong> Natural objects that orbit planets, such as Earth's moon.</li>\n<li><strong>Asteroids and Comets:</strong> Small celestial bodies composed of rock and ice, respectively, that orbit the Sun.</li>\n<li><strong>Galaxies:</strong> Vast systems of stars, gas, dust, and dark matter, such as the Milky Way.</li>\n</ul>\n<p><strong>2. Solar System:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Our solar system includes the Sun, planets, their moons, asteroids, and comets. Each planet has unique characteristics, such as Mercury's extreme temperatures and Venus's thick atmosphere.</li>\n</ul>\n<p><strong>3. Cosmology:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The study of the universe as a whole, including its origin, structure, and evolution. The Big Bang theory is the prevailing explanation for the universe's origin.</li>\n</ul>\n<p><strong>4. Stellar Life Cycles:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The life cycle of a star, from its birth as a collapsing cloud of gas and dust, through various stages, to its death as a white dwarf, neutron star, or black hole.</li>\n</ul>\n<p><strong>5. Exoplanets:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Planets outside our solar system that orbit other stars. Discoveries of exoplanets have expanded our understanding of planetary systems.</li>\n</ul>\n<p><strong>6. Black Holes:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Extremely dense regions in space where gravity is so intense that nothing, not even light, can escape. They are formed from the remnants of massive stars.</li>\n</ul>\n<p><strong>7. Telescopes:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Instruments used to observe and study distant celestial objects. Various types of telescopes, including optical, radio, and space telescopes, have advanced our knowledge of the cosmos.</li>\n</ul>\n<p><strong>8. Dark Matter and Dark Energy:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>These are mysterious substances that make up a significant portion of the universe. Dark matter's gravitational influence is evident in galaxies, while dark energy is thought to be responsible for the universe's accelerated expansion.</li>\n</ul>\n<p><strong>9. Astronomical Discoveries:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Astronomy has led to numerous discoveries, such as the cosmic microwave background radiation (evidence of the Big Bang), the existence of exoplanets, and the observation of distant galaxies.</li>\n</ul>","images":[],"files":[],"tags":["Astronomy","Science"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699203401937"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547c9ce9a2d8019f7c162f9"},"type":"Free","title":"පුරාණ ශිෂ්ටාචාර: මෙසපොතේමියාව","desc":"ලෝකයේ ආදිතම ශිෂ්ටාචාරවලින් එකක් වන මෙසපොතේමියාව වෙත ආපසු ගොස් මානව ඉතිහාසයට එහි දායකත්වය සොයා ගන්න.","content":"<p><strong>භූගෝල විද්යාව සහ පරිසරය:</strong></p>\n<p>මෙසපොතේමියාව යන්නෙහි තේරුම \"ගංගා අතර භූමිය\" වන අතර, ටයිග්&zwj;රිස් සහ යුප්&zwj;රටීස් ගංගාවල නිරන්තර ගංවතුර හේතුවෙන් එය සාරවත් කලාපයක් විය. මෙමගින් කෘෂිකර්මාන්තයට අවශ්&zwj;ය කොන්දේසි සපයා ඇත.<br>නගර-ප්රාන්ත:</p>\n<p>මෙසපොතේමියාව නගර රාජ්&zwj;ය රාශියකින් සමන්විත වූ අතර ඒ සෑම එකක්ම තමන්ගේම රජයක් සහ පාලකයෙකුගෙන් සමන්විත විය. උර්, උරුක්, ලගාෂ් සහ බැබිලෝනිය ප්&zwj;රමුඛ නගර රාජ්&zwj;යයන් විය.<br>ලිවීමේ පද්ධතිය:</p>\n<p>මෙසපොතේමියාව මානව ඉතිහාසයේ මුල්ම ලේඛන පද්ධතියක් වර්ධනය කිරීමේ ගෞරවය හිමි වේ. මැටි පුවරු මත කූඤ්ඤ හැඩැති සලකුණු භාවිතා කරන ලද Cuneiform, ලේඛනගත කිරීම සහ සාහිත්&zwj;යය ඇතුළු විවිධ අරමුණු සඳහා භාවිතා කරන ලදී.<br>නීති සංග්රහය:</p>\n<p>පැරණි යුගයේ වඩාත් ප්&zwj;රසිද්ධ නීති සංග්&zwj;රහයක් වන හම්මුරාබි සංග්&zwj;රහය බැබිලෝනියේ ස්ථාපිත කරන ලදී. එය එහි \"ඇසට ඇසක්\" මූලධර්මය සඳහා ප්&zwj;රසිද්ධ වන අතර යුක්තිය සහ පාලනය සඳහා රාමුවක් සපයා ඇත.<br>නව නිපැයුම් සහ ජයග්&zwj;රහණ:</p>\n<p>මෙසපොතේමියානුවන් පාදය-60 සංඛ්&zwj;යා පද්ධතියක් භාවිතා කිරීම ඇතුළුව ගණිතයට සැලකිය යුතු දායකත්වයක් ලබා දී ඇත.<br>ඔවුන් ප්&zwj;රවාහනයේ විප්ලවීය වෙනසක් ඇති කළ රෝදය දියුණු කළා.<br>ආරුක්කු සහ ගෝලාකාර වාස්තු විද්&zwj;යාත්මක නවෝත්පාදනයන් වන අතර ඒවා ඉදිකිරීම් සඳහා භාවිතා කරන ලදී.<br>සිග්ගුරාට්, පියගැටපෙළ පිරමීඩයක් වැනි ව්&zwj;යුහයක්, ප්&zwj;රමුඛ වාස්තු විද්&zwj;යාත්මක අංගයක් වූ අතර බොහෝ විට පන්සලක් හෝ ආගමික මධ්&zwj;යස්ථානයක් ලෙස සේවය කළේය.<br>ආගම:</p>\n<p>මෙසපොතේමියානුවන්ට දෙවි දේවතාවුන්ගේ දේවමෙහෙයක් සහිත බහුදේවවාදී විශ්වාස පද්ධතියක් තිබුණි. මෙම දෙවිවරුන්ට ගෞරව කිරීම සඳහා විහාරස්ථාන ඉදිකරන ලද අතර, ආගමික වතාවත්වලදී පූජකයන් වැදගත් කාර්යභාරයක් ඉටු කළහ.<br>කෘෂිකර්ම:</p>\n<p>කලාපයේ කෘෂිකාර්මික භාවිතයන් පදනම් වූයේ ටයිග්&zwj;රිස් සහ යුප්&zwj;රටීස් ගංගාවල වාරිමාර්ග මතය. ඔවුන් බාර්ලි, තිරිඟු සහ රටඉඳි වැනි භෝග වගා කළහ.<br>වෙළඳ:</p>\n<p>මෙසපොතේමියාවේ කේන්ද්&zwj;රීය ස්ථානය එය වෙළඳාමේ කේන්ද්&zwj;රස්ථානයක් බවට පත් කළේය. අවට ප්&zwj;රදේශවලින් දැව හා ලෝහ වැනි වටිනා සම්පත් වෙත ප්&zwj;රවේශ විය.<br>ප්රතික්ෂේප කිරීම:</p>\n<p>මෙසපොතේමියාව ඇසිරියානුවන්, බැබිලෝනියන් සහ පර්සියානුවන් ඇතුළු විවිධ අසල්වැසි අධිරාජ්&zwj;යයන්ගේ ආක්&zwj;රමණවලට මුහුණ දුන්නේය. කලාපය ජයග්&zwj;රහණ මාලාවක් සහ පාලනයේ වෙනස්කම් මාලාවක් දුටු අතර එය අවසානයේ පරිහානියට හේතු විය.<br>උරුමය:</p>\n<p>මෙසපොතේමියාවේ උරුමයට ලිවීම, ගණිතය සහ ගෘහ නිර්මාණ ශිල්පය සඳහා එහි දායකත්වය ඇතුළත් වේ. මෙම කලාපයේ සංස්කෘතික හා ඓතිහාසික වැදගත්කම මානව ශිෂ්ටාචාරය මත කල්පවත්නා බලපෑමක් ඇති කර ඇත.<br>මෙසපොතේමියාව මානව සමාජයේ සංවර්ධනය සඳහා තීරණාත්මක කාර්යභාරයක් ඉටු කළ අතර එහි නවෝත්පාදනයන් සහ සංස්කෘතික දායකත්වයන් අද දක්වාම ලෝකයට බලපෑම් කරයි.</p>","images":[],"files":[],"tags":["History","o/l","School"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699203531262"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547ca079a2d8019f7c162fb"},"type":"Free","title":"The Renaissance: Art and Culture","desc":"Explore the Renaissance period, focusing on art, science, and the rebirth of classical influences in Europe.","content":"<p><strong>1. Humanism:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Humanism was a central intellectual movement during the Renaissance. It emphasized the study of classical texts and a focus on human potential and achievements.</li>\n</ul>\n<p><strong>2. Artistic Achievements:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The Renaissance produced some of the most iconic artists in history, including Leonardo da Vinci, Michelangelo, Raphael, and Sandro Botticelli. They created masterpieces that demonstrated a deep understanding of anatomy, perspective, and naturalism.</li>\n</ul>\n<p><strong>3. Renaissance Art Styles:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Realism:</strong> Artists aimed for a realistic representation of the human form, nature, and everyday life.</li>\n<li><strong>Linear Perspective:</strong> Artists developed techniques to create a sense of depth and three-dimensionality on a two-dimensional surface.</li>\n<li><strong>Chiaroscuro:</strong> The use of strong contrasts between light and dark to create volume in modeling three-dimensional objects and figures.</li>\n<li><strong>Sfumato:</strong> A technique of blurring and softening outlines to create a smoky or hazy effect, often used by Leonardo da Vinci.</li>\n</ul>\n<p><strong>4. Famous Works:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Leonardo da Vinci's \"Mona Lisa\" and \"The Last Supper.\"</li>\n<li>Michelangelo's \"David\" and the ceiling of the Sistine Chapel.</li>\n<li>Raphael's \"The School of Athens.\"</li>\n<li>Botticelli's \"The Birth of Venus.\"</li>\n</ul>\n<p><strong>5. Literature:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Renaissance literature included works by authors like Dante Alighieri (\"Divine Comedy\"), Petrarch (poetry), and Geoffrey Chaucer (\"The Canterbury Tales\").</li>\n</ul>\n<p><strong>6. Scientific Advancements:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Renaissance thinkers, including Copernicus and Galileo, made significant contributions to astronomy, challenging the geocentric view of the universe.</li>\n</ul>\n<p><strong>7. Printing Press:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The invention of the printing press by Johannes Gutenberg revolutionized the spread of knowledge and literature.</li>\n</ul>\n<p><strong>8. Patronage:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Wealthy families and rulers played a vital role in supporting artists and scholars, enabling the flourishing of the Renaissance.</li>\n</ul>\n<p><strong>9. Spread Across Europe:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The Renaissance eventually spread from Italy to other European countries, each adopting its own regional variations and artistic expressions.</li>\n</ul>\n<p><strong>10. Legacy:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The Renaissance had a profound and lasting impact on art, culture, and thought. It laid the foundation for the modern world, with its emphasis on individualism, human potential, and the pursuit of knowledge.</li>\n</ul>\n<p>The Renaissance is often considered one of the most transformative periods in human history, and its contributions to art, culture, and the human spirit continue to be celebrated and studied to this day.</p>","images":[],"files":[],"tags":["History","School","o/l"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699203591811"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547ca479a2d8019f7c162fd"},"type":"Free","title":"The American Revolution: A Quest for Independence","desc":"Delve into the American Revolution, its causes, key figures, and the path to American independence.","content":"<p><strong>Background:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The American colonies, including Massachusetts, Virginia, Pennsylvania, and New York, were under British colonial rule in the 18th century.</li>\n<li>Tensions between the colonies and the British government grew over issues like taxation without representation and British interference in colonial affairs.</li>\n</ul>\n<p><strong>Causes:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li><strong>Taxation without Representation:</strong> The British imposed various taxes on the colonies, such as the Stamp Act and the Townshend Acts, without allowing colonial representation in the British Parliament.</li>\n<li><strong>Trade Regulations:</strong> The British imposed trade restrictions on the colonies, including the Navigation Acts, which limited colonial commerce.</li>\n<li><strong>The Boston Massacre:</strong> In 1770, a confrontation between British soldiers and colonists in Boston led to several deaths, further fueling anti-British sentiments.</li>\n<li><strong>The Boston Tea Party:</strong> In 1773, American colonists, disguised as Native Americans, boarded British ships and dumped tea into Boston Harbor to protest the Tea Act.</li>\n</ol>\n<p><strong>Key Events:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Lexington and Concord (1775):</strong> The first military engagements of the American Revolution took place in Massachusetts when British troops attempted to seize colonial arms. This marked the start of the armed conflict.</p>\n</li>\n<li>\n<p><strong>Declaration of Independence (1776):</strong> The Continental Congress adopted the Declaration of Independence on July 4, 1776, drafted by Thomas Jefferson. It declared the 13 American colonies independent from British rule.</p>\n</li>\n<li>\n<p><strong>The Revolutionary War:</strong> The war raged on for several years, with significant battles like Saratoga and Yorktown. The French joined the American cause, providing military support.</p>\n</li>\n<li>\n<p><strong>Treaty of Paris (1783):</strong> The conflict ended with the Treaty of Paris, which recognized the independence of the United States and established new national borders.</p>\n</li>\n</ol>\n<p><strong>Key Figures:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>George Washington:</strong> Commanded the Continental Army and later became the first President of the United States.</li>\n<li><strong>Thomas Jefferson:</strong> Author of the Declaration of Independence.</li>\n<li><strong>Benjamin Franklin:</strong> A diplomat who played a key role in securing French support for the American cause.</li>\n<li><strong>King George III:</strong> The British monarch during the American Revolution.</li>\n</ul>\n<p><strong>Impact:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The American Revolution established the United States of America as an independent nation.</li>\n<li>It inspired other independence movements and influenced the development of democratic principles worldwide.</li>\n<li>The U.S. Constitution, adopted in 1787, became a model for democratic governance.</li>\n</ul>\n<p>The American Revolution remains a symbol of the pursuit of liberty and self-determination. It laid the groundwork for the development of a new nation based on principles of democracy, freedom, and individual rights.</p>","images":[],"files":[],"tags":["History","school","o/l"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699203655287"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547ca959a2d8019f7c162ff"},"type":"Free","title":"World War II: The Global Conflict","desc":"Examine the Second World War, its major events, and its profound impact on the world, both during and after the war.","content":"<p><strong>Causes:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li><strong>Treaty of Versailles:</strong> The harsh terms imposed on Germany after World War I created economic and political instability, contributing to the rise of Adolf Hitler and the Nazi Party.</li>\n<li><strong>Expansionist Ambitions:</strong> Hitler sought to expand German territory and influence, starting with the reoccupation of the Rhineland and the annexation of Austria and Czechoslovakia.</li>\n<li><strong>Appeasement:</strong> European powers initially adopted a policy of appeasement, hoping to avoid another war by conceding to some of Hitler's demands.</li>\n</ol>\n<p><strong>Major Alliances:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li><strong>Axis Powers:</strong> Led by Germany, Italy, and Japan.</li>\n<li><strong>Allied Powers:</strong> Led by the United Kingdom, the Soviet Union, and the United States. The U.S. joined the war after the attack on Pearl Harbor in 1941.</li>\n</ol>\n<p><strong>Key Events:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li><strong>Invasion of Poland (1939):</strong> Germany's invasion of Poland triggered the war, leading to the United Kingdom and France declaring war on Germany.</li>\n<li><strong>Blitzkrieg:</strong> Germany's rapid, highly coordinated military campaigns in Europe, including the invasion of France.</li>\n<li><strong>Battle of Britain (1940):</strong> A pivotal air battle in which the Royal Air Force successfully defended the United Kingdom from German aerial attacks.</li>\n<li><strong>Operation Barbarossa (1941):</strong> Germany's invasion of the Soviet Union, resulting in significant fighting on the Eastern Front.</li>\n<li><strong>Pearl Harbor (1941):</strong> The surprise attack by Japan on the U.S. naval base in Hawaii, bringing the United States into the war.</li>\n<li><strong>D-Day (1944):</strong> Allied forces landed in Normandy, France, leading to the liberation of Western Europe from Nazi occupation.</li>\n<li><strong>Holocaust:</strong> The systematic genocide of six million Jews and millions of others by the Nazis.</li>\n</ol>\n<p><strong>Theaters of War:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li><strong>European Theater:</strong> Focused on the war in Europe, including the Western Front, Eastern Front, and North African campaigns.</li>\n<li><strong>Pacific Theater:</strong> Centered on the conflict in the Pacific, including battles in the Philippines, Guadalcanal, and Iwo Jima.</li>\n</ol>\n<p><strong>Consequences:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li><strong>Atomic Bombs:</strong> The United States dropped atomic bombs on Hiroshima and Nagasaki in 1945, leading to Japan's surrender.</li>\n<li><strong>Nuremberg Trials:</strong> High-ranking Nazi officials were prosecuted for war crimes and crimes against humanity.</li>\n<li><strong>Formation of the United Nations:</strong> The international organization was established to promote peace and cooperation among nations.</li>\n<li><strong>Division of Germany:</strong> The country was divided into East and West Germany, with the Berlin Wall separating them during the Cold War.</li>\n<li><strong>Cold War:</strong> The ideological conflict between the United States and the Soviet Union emerged, shaping post-war geopolitics.</li>\n</ol>\n<p>World War II had a profound impact on the world, leading to significant political, social, and economic changes. It also highlighted the importance of international cooperation and the need to prevent future global conflicts.</p>","images":[],"files":[],"tags":["History","school"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699203733013"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547cae99a2d8019f7c16301"},"type":"Free","title":"Civil Rights Movement: Striving for Equality","desc":"Learn about the Civil Rights Movement in the United States, its leaders, and its impact on ending racial segregation.","content":"<p><strong>Background:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>African Americans in the United States faced systemic racism, segregation, and disenfranchisement, particularly in the Southern states, in the years following the American Civil War.</li>\n</ul>\n<p><strong>Key Figures:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Martin Luther King Jr.:</strong> A prominent civil rights leader who advocated for nonviolent protest and delivered the famous \"I Have a Dream\" speech during the March on Washington in 1963.</li>\n<li><strong>Rosa Parks:</strong> Her refusal to give up her seat on a segregated bus in Montgomery, Alabama, in 1955, sparked the Montgomery Bus Boycott.</li>\n<li><strong>Malcolm X:</strong> A prominent civil rights activist who advocated for self-defense and Black empowerment.</li>\n<li><strong>Thurgood Marshall:</strong> The first African American Supreme Court Justice, he played a crucial role in the legal battle against segregation, including the landmark Brown v. Board of Education case.</li>\n</ul>\n<p><strong>Key Events:</strong></p>\n<ol style=\"list-style-type: none;\">\n<li>\n<p><strong>Brown v. Board of Education (1954):</strong> The Supreme Court ruled that racial segregation in public schools was unconstitutional, overturning the \"separate but equal\" doctrine.</p>\n</li>\n<li>\n<p><strong>Montgomery Bus Boycott (1955-1956):</strong> The year-long boycott following Rosa Parks' arrest led to the desegregation of the Montgomery bus system.</p>\n</li>\n<li>\n<p><strong>Civil Rights Act of 1964:</strong> This landmark legislation outlawed discrimination based on race, color, religion, sex, or national origin.</p>\n</li>\n<li>\n<p><strong>Voting Rights Act of 1965:</strong> This act eliminated discriminatory voting practices and allowed African Americans to exercise their right to vote.</p>\n</li>\n<li>\n<p><strong>March on Washington for Jobs and Freedom (1963):</strong> A massive civil rights demonstration where Martin Luther King Jr. delivered his famous \"I Have a Dream\" speech.</p>\n</li>\n<li>\n<p><strong>Selma to Montgomery March (1965):</strong> A series of marches that advocated for voting rights, culminating in the passage of the Voting Rights Act.</p>\n</li>\n<li>\n<p><strong>Assassinations:</strong> The movement witnessed tragic assassinations, including those of Medgar Evers, Malcolm X, and Martin Luther King Jr.</p>\n</li>\n</ol>\n<p><strong>Nonviolent Resistance:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>Civil rights leaders, inspired by Mahatma Gandhi's principles of nonviolence, used tactics such as sit-ins, boycotts, and peaceful protests to draw attention to their cause.</li>\n</ul>\n<p><strong>Challenges and Resistance:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The Civil Rights Movement faced significant opposition, including violent attacks on activists and voter suppression efforts.</li>\n</ul>\n<p><strong>Legacy:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The Civil Rights Movement led to significant legal and social changes, including the end of legal segregation and the expansion of voting rights.</li>\n<li>It laid the groundwork for subsequent movements for equality, including the women's rights and LGBTQ+ rights movements.</li>\n</ul>\n<p>The Civil Rights Movement played a crucial role in advancing civil rights and justice in the United States, challenging systemic racism and discrimination. While significant progress has been made, the struggle for equality and justice continues.</p>","images":[],"files":[],"tags":["History","school"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699203817774"}},"updatedAt":{"$date":{"$numberLong":"1699203924100"}}}

{"_id":{"$oid":"6547cc4c9a2d8019f7c16303"},"type":"Free","title":"Wave-Particle Duality","desc":" This note covers the concept of wave-particle duality in quantum physics, explaining how particles like electrons exhibit both wave-like and particle-like properties.","content":"<p><strong>Wave-Like Behavior:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>In certain experiments, particles like electrons and photons exhibit characteristics of waves.</li>\n<li>This wave-like behavior is associated with properties such as interference and diffraction. Interference occurs when waves combine to form regions of higher or lower intensity, and diffraction is the bending of waves around obstacles.</li>\n<li>The phenomenon is similar to how light waves can create patterns of bright and dark regions when they pass through narrow slits or obstacles.</li>\n</ul>\n<p><strong>Particle-Like Behavior:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>In other situations, the same particles can behave like discrete, localized particles, with definite positions and momenta.</li>\n<li>When observed or detected, particles appear as distinct entities, such as when they strike a detector in a specific location.</li>\n<li>This particle-like behavior is linked to concepts such as quantization, where particles have discrete energy levels and quantized angular momentum.</li>\n</ul>\n<p><strong>Wave-Particle Duality Experiments:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The double-slit experiment is a classic example of wave-particle duality. In this experiment, particles, such as electrons or photons, are directed at a barrier with two slits. The particles pass through both slits as waves, creating an interference pattern on a screen behind the barrier. However, when individual particles are detected, they appear as discrete impacts on the screen.</li>\n<li>Young's double-slit experiment is a historical example of this phenomenon involving light waves.</li>\n<li>Experiments with electrons, protons, and other subatomic particles have confirmed their wave-particle duality.</li>\n</ul>\n<p><strong>Uncertainty Principle:</strong></p>\n<ul style=\"list-style-type: disc;\">\n<li>The Heisenberg Uncertainty Principle, formulated by Werner Heisenberg, is closely related to wave-particle duality. It states that it is impossible to simultaneously measure both the position and momentum of a particle with arbitrary precision. The more accurately one property is known (e.g., position), the less accurately the other (e.g., momentum) can be determined.</li>\n</ul>\n<p>Wave-particle duality is a fundamental aspect of quantum mechanics and has profound implications for our understanding of the behavior of particles at the quantum level. It challenges classical notions of determinism and underscores the probabilistic nature of quantum systems. This concept is crucial in explaining the behavior of particles in a wide range of physical phenomena, including the behavior of electrons in atoms and the interaction of photons with matter.</p>","images":[],"files":[],"tags":["physics","science"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699204172846"}},"updatedAt":{"$date":{"$numberLong":"1699204198531"}}}

{"_id":{"$oid":"6549054575af565ddf3f876b"},"type":"Free","title":"Physics Worksheet","desc":"Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.","content":"<p><span style=\"font-size: 24pt;\"><strong>Lorem ipsum dolor sit amet,</strong></span> consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</p>\n<h4>Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</h4>\n<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</p>","images":["https://firebasestorage.googleapis.com/v0/b/notemex-76c0b.appspot.com/o/images%2F625f287a504a07feb20d7d9429293a07.jpg?alt=media&token=f82aadcd-4f94-48be-83af-e0fc7921ea03","https://firebasestorage.googleapis.com/v0/b/notemex-76c0b.appspot.com/o/images%2F1.jpg?alt=media&token=77632e16-f28e-49d5-a5b7-72b020e46f24"],"files":["https://firebasestorage.googleapis.com/v0/b/notemex-76c0b.appspot.com/o/upload%2F59.pdf?alt=media&token=6ff1ef5d-48e3-42e7-9365-b83491e0d717"],"tags":["physics","worksheet","anuradha perera"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699284289609"}},"updatedAt":{"$date":{"$numberLong":"1699284318369"}}}

{"_id":{"$oid":"654b8c05797abbeaeda84105"},"type":"Free","title":"MasterD - Huga Denek (හුග දෙනෙක්)Official Music Video [Animation]","desc":"Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.","content":"<p><iframe src=\"https://www.youtube.com/embed/c4emZ4_CBuU?list=RDc4emZ4_CBuU\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p>","images":[],"files":[],"tags":["Music","Master D"],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699449861293"}},"updatedAt":{"$date":{"$numberLong":"1699450740757"}}}

{"_id":{"$oid":"654b8f32797abbeaeda84107"},"type":"Free","title":"Testing pending note","desc":"Testing pending note","content":"<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</p>","images":[],"files":[],"tags":[],"price":{"$numberLong":"0"},"approved":{"$numberLong":"0"},"createdAt":{"$date":{"$numberLong":"1699450674649"}},"updatedAt":{"$date":{"$numberLong":"1699450674649"}}}

{"_id":{"$oid":"654e3d6f7fd174c22e5b254f"},"type":"Free","title":"Test maleesha the great note 1 ","desc":"Test maleesha the great note 1 ","content":"<p>Test maleesha the great note 1&nbsp;</p>","images":[],"files":[],"tags":[],"price":{"$numberLong":"0"},"approved":"APPROVED","createdAt":{"$date":{"$numberLong":"1699626351623"}},"updatedAt":{"$date":{"$numberLong":"1699626485862"}}}
